app/views/students/index.html.erb

SELECT "students".* FROM "students"
---

                    return alasql(SQL, [allData]).map(function (x) {
                    return x.student;
                    });