app/controllers/students_controller.rb

  def index
    @students = Student.all
    # @students_json = Student.all.map do |item| (item).to_hash end).to_json
    @students_json = Student.all.map{|x| x }.to_json
---
SELECT "students".* FROM "students"