app/controllers/users_controller.rb

  def index
    @users = User.where.not(is_admin: true)
---
SELECT "users".* FROM "users" WHERE "users"."is_admin" != $1  [["is_admin", true]]